tap "homebrew/services"
tap "nats-io/nats-tools"
tap "ngrok/ngrok"
tap "opencode-ai/tap"
tap "sst/tap"
# Asciicast to GIF converter
brew "agg"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Text-based personal organizer
brew "calcurse"
# Multi-shell multi-command argument completer
brew "carapace"
# Insanely fast image printing in your terminal
brew "catimg"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# High-performance, asynchronous messaging library
brew "zeromq"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: :changed
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Library and command-line tool for SSH
brew "fabric"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Grassroots DICOM library and utilities for medical files
brew "gdcm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Slightly more awesome Standard Unix Password Manager for Teams
brew "gopass"
# Generic library support script
brew "libtool"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# International Ispell
brew "ispell"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Postgres C API library
brew "libpq"
# LLVM Project Linker
brew "lld"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Package manager for the Lua programming language
brew "luarocks"
# Securely transfers data between computers
brew "magic-wormhole"
# Swiss Army knife of email handling
brew "mailutils"
# Utility for directing compilation
brew "make"
# Scalable distributed version control system
brew "mercurial"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd", restart_service: :changed
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tool for searching e-mail messages stored in the maildir-format
brew "mu"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Open source relational database management system
brew "mysql-client"
# NCurses Disk Usage
brew "ncdu"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# Podman Terminal User Interface
brew "podman-tui"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Software environment for statistical computing
brew "r", link: false
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Tool to build, change, and version infrastructure
brew "terraform"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Tunnel TCP connections over the Tox protocol
brew "tuntox"
# Unpack everything with one command
brew "unp"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# Access X11 clipboards from the command-line
brew "xclip"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# NATS utility
brew "nats-io/nats-tools/nats"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Aria2 GUI
cask "aria2d"
# Create and run Linux containers using lightweight virtual machines
cask "container"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Open-source video transcoder
cask "handbrake-app"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Extensible editor for OpenStreetMap
cask "josm"
# Password manager app
cask "keepassxc"
# Use Vim in input fields and non input fields
cask "kindavim"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Environment for statistical computing and graphics
cask "r-app"
# Archive manager for data compression and backups
cask "rar"
# Data science software focusing on R and Python
cask "rstudio"
# Open source virtual/remote desktop application
cask "rustdesk"
# App that enables mouse-free UI interaction
cask "shortcat"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Media server supporting DLNA, UPnP and HTTP(S)
cask "universal-media-server"
# Multimedia player
cask "vlc"
# Terminal emulator
cask "wave"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Browse & Control phone on PC, Screen Fusion for iOS & Android
cask "wormhole"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Collect, organise, cite, and share research sources
cask "zotero"
