abseil
agg
aom
apache-arrow
aria2
aribb24
asciinema
assimp
assimp@5
autoconf
automake
aws-c-auth
aws-c-cal
aws-c-common
aws-c-compression
aws-c-event-stream
aws-c-http
aws-c-io
aws-c-mqtt
aws-c-s3
aws-c-sdkutils
aws-checksums
aws-crt-cpp
aws-sdk-cpp
bash
bat
boost
brotli
c-ares
ca-certificates
cairo
calcurse
catimg
ccls
certifi
cffi
chromaprint
cjson
cloudflared
cmake
cmake-docs
coreutils
cryptography
ctags
dav1d
dbus
direnv
double-conversion
duf
expat
eza
faad2
fabric
fabric-ai
fd
ffmpeg
fftw
flac
fluid-synth
fmt
fnm
fontconfig
freetype
frei0r
fribidi
fzf
game-music-emu
gcc
gd
gdb
gdk-pixbuf
gettext
gh
ghostscript
giflib
git
glances
glib
gmime
gmp
gnupg
gnuplot
gnutls
go
gopass
gpgme
graphite2
graphviz
grpc
gsasl
gts
handbrake
harfbuzz
highway
hledger
hunspell
hwloc
icu4c@75
icu4c@77
imagemagick
imath
iproute2mac
isl
ispell
jansson
jasper
jbig2dec
jpeg-turbo
jpeg-xl
jupyterlab
krb5
kubernetes-cli
lame
lazydocker
lazygit
leptonica
lesspipe
lf
libao
libarchive
libass
libassuan
libavif
libb2
libbluray
libcbor
libcerf
libconfig
libde265
libdeflate
libevent
libfido2
libgccjit
libgcrypt
libgit2
libgpg-error
libheif
libid3tag
libidn
libidn2
libksba
liblqr
libmaxminddb
libmicrohttpd
libmikmod
libmng
libmpc
libmpdclient
libnfs
libnghttp2
libnghttp3
libogg
libomp
libpng
libpq
libraw
librist
librsvg
libsamplerate
libshout
libsmi
libsndfile
libsodium
libsoxr
libssh
libssh2
libtasn1
libtiff
libtool
libunibreak
libunistring
libupnp
libusb
libuv
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libyaml
little-cms2
lld
llvm
lpeg
lua
luacheck
luajit
luarocks
luv
lz4
lzo
m4
magic-wormhole
mailutils
make
mbedtls
md4c
mercurial
minikube
mise
moreutils
mpc
mpd
mpdecimal
mpfr
mpg123
mtr
mu
multimarkdown
mysql-client
ncdu
ncmpcpp
ncurses
neovim
netpbm
nettle
nlohmann-json
node
npth
nspr
nss
oniguruma
open-mpi
openblas
opencore-amr
openexr
openjdk
openjpeg
openssl@3
opus
p11-kit
p7zip
pandoc
pango
pcre2
pinentry
pinentry-mac
pipx
pixman
pkgconf
plantuml
pmix
podman
poppler
popt
portaudio
procs
progress
protobuf
pycparser
pyenv-virtualenv
python-packaging
python@3.12
python@3.13
qpdf
qt
r
rav1e
rbenv
re2
readline
ripgrep
rsync
rubberband
ruby
ruby-build
rust
sdl2
shared-mime-info
snappy
sops
speex
speexdsp
sqlite
srt
starship
svt-av1
taglib
tcl-tk@8
terminal-notifier
terminalimageviewer
termshark
terraform
tesseract
theora
thrift
tlrc
tmux
toxcore
tree
tree-sitter
trivy
tuntox
unbound
unibilium
unp
usage
utf8cpp
utf8proc
uv
vim
watch
wavpack
webp
wget
wireshark
wordnet
x264
x265
xapian
xorgproto
xvid
xxhash
xz
yazi
yt-dlp
z3
zeromq
zimg
zlib
zoxide
zsh-autosuggestions
zsh-syntax-highlighting
zstd
aria2d
font-hack-nerd-font
font-meslo-lg-nerd-font
gimp
handbrake
handbrake-app
iterm2
josm
keepassxc
lunar
pgadmin4
r
r-app
rar
rstudio
rustdesk
shortcat
stolendata-mpv
universal-media-server
vlc
wave
wezterm
wormhole
xquartz
zotero
